omp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-26 Sun 23:18 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orthogonal Matching Pursuit (OMP)</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Orthogonal Matching Pursuit (OMP)</h1>
<p>
<i>Matching pursuit (MP)</i> and its improvement <i>orthogonal matching pursuit (OMP)</i> are both popular algorithms in <i>compressive sensing (CS)</i>. Compared to MP, OMP can offer better performance, e.g. in respects of higher precision and faster convergency. This post aims to summarize the detailed procedure of OMP.
</p>

<p>
Given a NP-hard problem
</p>
\begin{align*}
  \mathcal{L}:\quad &\arg\min_{\mathbf{x}}\|\mathbf{x}\|_0 \\
  \mathrm{subject~to}\quad & \mathbf{Ax} = \mathbf{b}
\end{align*}
<p>
where
</p>
<ul class="org-ul">
<li>\(\mathbf{A} \in \mathbb{C}^{m \times n}\) is a <i>short-fat</i> matrix, i.e., \(n \gg m\).</li>
<li>\(\mathbf{b}\in\mathbb{C}^m\).</li>
<li>\(\mathbf{x}\in\mathbb{C}^n\).
<ul class="org-ul">
<li>\(\|\mathbf{x}\|_0\) is \(\ell_0\) norm of \(\mathbf{x}\), i.e., the number of non-zero elements of \(\mathbf{x}\), a.k.a. the <i>sparsity</i> of \(\mathbf{x}\);</li>
<li><p>
The set comprising the indices of all non-zero elements in \(\mathbf{x}\) is termed the <i>support</i> of \(\mathbf{x}\), denoted by
</p>
\begin{align*}
  \mathrm{supp}(\mathbf{x}) \triangleq \{i \mid [\mathbf{x}]_i \neq 0\}.
\end{align*}</li>
</ul></li>
</ul>

<p>
OMP is an iterative algorithm, in which \(\mathrm{supp}(\mathbf{x})\) is determined one by one and in each iteration the problem is optimally solved based on the current info. The detailed procedure of the algorithm can be listed in Table <a href="#orgc3abf02">1</a>.
</p>
<table id="orgc3abf02" align="center">
<caption class="t-above"><span class="table-number">Table 1:</span> Algorithm \(\mathrm{OMP}(\mathbf{A}, \mathbf{b})\)</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Input</b>:</td>
<td class="org-left">\(\mathbf{A}\), \(\mathbf{b}\).</td>
</tr>

<tr>
<td class="org-left"><b>Result</b>:</td>
<td class="org-left">\(\mathbf{x}_k\)</td>
</tr>

<tr>
<td class="org-left"><b>Initialization</b>:</td>
<td class="org-left">\(\mathbf{r}_0 = \mathbf{b}\), \(\mathcal{S}_0 = \emptyset\).</td>
</tr>

<tr>
<td class="org-left"><b>for</b></td>
<td class="org-left">\(k=1,2,\ldots\) <b>do</b></td>
</tr>

<tr>
<td class="org-left"><code>step-1</code></td>
<td class="org-left">\(\lambda_k = \arg\max\limits_{i\notin\mathcal{S}_{k-1}}\vert[\mathbf{A}]_i^T \mathbf{r}_{k-1}\vert\)</td>
</tr>

<tr>
<td class="org-left"><code>step-2</code></td>
<td class="org-left">\(\mathcal{S}_k = \mathcal{S}_{k-1} \bigcup \{\lambda_k\}\)</td>
</tr>

<tr>
<td class="org-left"><code>step-3</code></td>
<td class="org-left">\([\mathbf{x}_k]_{\mathcal{S}_k} = \arg\min\limits_{\mathbf{x}}\vert\vert[\mathbf{A}]_{\mathcal{S}_k}\mathbf{x} - \mathbf{b}\vert\vert_2\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\([\mathbf{x}_k]_{\overline{\mathcal{S}_k}}=\mathbf{0}_{n-\vert\mathcal{S}_k\vert}\)</td>
</tr>

<tr>
<td class="org-left"><code>step-4</code></td>
<td class="org-left">\(\hat{\mathbf{b}}_k = [\mathbf{A}]_{\mathcal{S}_k}[\mathbf{x}_k]_{\mathcal{S}_k} = \mathbf{A}\mathbf{x}_k\)</td>
</tr>

<tr>
<td class="org-left"><code>step-5</code></td>
<td class="org-left">\(\mathbf{r}_k = \mathbf{b} - \hat{\mathbf{b}}_k\)</td>
</tr>

<tr>
<td class="org-left"><b>end</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>In <code>step-1</code>, the most correlated component is selected by traversing the candidates in the dictionary but outside \(\mathcal{S}\).</li>
<li>In <code>step-2</code>, the support of \(\mathbf{x}\), i.e., \(\mathrm{supp}(\mathbf{x})\) is updated by adding the resultant index obtained in <code>step-1</code>.</li>
<li><p>
In <code>step-3</code>, <i>least square (LS) regression</i> is conducted based on the latest support of \(\mathbf{x}\), i.e., \(\mathrm{supp}(\mathbf{x})\),
</p>
\begin{align*}
  [\mathbf{x}_k]_{\mathcal{S}_k} = [\mathbf{A}]_{\mathcal{S}_k}^\dagger\mathbf{b}
\end{align*}
<p>
where \([\mathbf{A}]_{\mathcal{S}_k}^\dagger = \left([\mathbf{A}]_{\mathcal{S}_k}^H [\mathbf{A}]_{\mathcal{S}_k}\right)^{-1}[\mathbf{A}]_{\mathcal{S}_k}^H\) is the Moore Penrose inverse of \([\mathbf{A}]_{\mathcal{S}_k}\).
</p></li>
<li>In <code>step-4</code>, the overall contributions of the components in the support are reconstructed.</li>
<li>In <code>step-5</code>, residual is updated by subtracting the contributions reconstructed in <code>step-4</code> from \(\mathbf{b}\).</li>
</ul>
</div>
</body>
</html>
